scripts/bash-scripts/test_results/concurrent_upload.txt

Summary:
  Total:	0.0131 secs
  Slowest:	0.0100 secs
  Fastest:	0.0015 secs
  Average:	0.0055 secs
  Requests/sec:	763.0166
  
  Total data:	480 bytes
  Size/request:	48 bytes

Response time histogram:
  0.001 [1]	|■■■■■■■■■■■■■■■■■■■■
  0.002 [2]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [2]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.007 [0]	|
  0.007 [1]	|■■■■■■■■■■■■■■■■■■■■
  0.008 [1]	|■■■■■■■■■■■■■■■■■■■■
  0.009 [1]	|■■■■■■■■■■■■■■■■■■■■
  0.010 [2]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 0.0018 secs
  25% in 0.0027 secs
  50% in 0.0072 secs
  75% in 0.0100 secs
  90% in 0.0100 secs
  0% in 0.0000 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0012 secs, 0.0015 secs, 0.0100 secs
  DNS-lookup:	0.0006 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0008 secs, 0.0002 secs, 0.0017 secs
  resp wait:	0.0029 secs, 0.0011 secs, 0.0053 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [201]	10 responses