scripts/bash-scripts/test_results/stress_test.txt

Summary:
  Total:	0.0167 secs
  Slowest:	0.0042 secs
  Fastest:	0.0004 secs
  Average:	0.0016 secs
  Requests/sec:	5971.2633
  
  Total data:	4400 bytes
  Size/request:	44 bytes

Response time histogram:
  0.000 [1]	|■
  0.001 [3]	|■■■■
  0.001 [29]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [31]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [16]	|■■■■■■■■■■■■■■■■■■■■■
  0.002 [3]	|■■■■
  0.003 [7]	|■■■■■■■■■
  0.003 [3]	|■■■■
  0.003 [3]	|■■■■
  0.004 [1]	|■
  0.004 [3]	|■■■■


Latency distribution:
  10% in 0.0008 secs
  25% in 0.0010 secs
  50% in 0.0013 secs
  75% in 0.0018 secs
  90% in 0.0028 secs
  95% in 0.0034 secs
  99% in 0.0042 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0004 secs, 0.0042 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0013 secs, 0.0003 secs, 0.0025 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	100 responses